# ViewerShowUncropped Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ViewerShowUncropped Property
ParameterTypeId Class See Also
---
"Show uncropped"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ViewerShowUncropped { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ViewerShowUncropped As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ViewerShowUncropped {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace